{ "translations": {
    "Full path to python interpreter" : "Directorio completo del intérprete de Python",
    "Absolute path to the python runnable (e.g. \"/usr/bin/python3\"). Can be obtained by `which python3` command. Used when pre-compiled binaries option is not selected." : "Ruta absoluta al ejecutable de Python (por ejemplo, \"/usr/bin/python3\"). Puede obtenerse mediante el comando `which python3`. Se utiliza cuando no se selecciona la opción de binarios precompilados.",
    "Remote/Encrypted file size limit to process" : "Límite de tamaño de archivo remoto/cifrado a procesar",
    "Maximum file size (in GBytes) for requesting from php core. Used when file is hosted on remote NC instance or have encrypted flag. Must be less than total available RAM size." : "Tamaño máximo del archivo (en gigabytes) para solicitar desde el núcleo de PHP. Se utiliza cuando el archivo está alojado en una instancia remota de NC o tiene la marca de cifrado. Debe ser menor que el tamaño total de RAM disponible.",
    "Use path to PHP interpreter for Python from settings" : "Usar la ruta al intérprete de PHP para Python desde la configuración",
    "Determine whether to use path from settings or detect it automatically (may not work with some unusual PHP install locations). Used in Python part." : "Determinar si utilizar la ruta de la configuración o detectarla automáticamente (puede que no funcione con algunas ubicaciones de instalación inusuales de PHP). Se utiliza en la parte de Python.",
    "Full path to PHP interpreter for Python" : "Ruta completa al intérprete de PHP para Python",
    "Absolute path to the PHP executable (e.g. \"/usr/bin/php7.4\"). Can be obtained by `which php` or `which php7.4` command" : "Ruta absoluta al ejecutable de PHP (por ejemplo, \"/usr/bin/php7.4\"). Puede obtenerse mediante los comandos `which php` o `which php7.4`.",
    "Use pre-compiled Python binaries" : "Usar binarios precompilados de Python",
    "Use Python part in binary format (located in the appdata folder)" : "Utilizar la parte de Python en formato binario (ubicado en la carpeta appdata)",
    "Framework log level" : "Nivel de registro del framework",
    "Used by apps, that are using this framework" : "Utilizado por las aplicaciones que utilizan este framework",
    "Cloud Python API" : "API de Python para Nextcloud",
    "Nextcloud Python API (Framework)" : "API de Python para Nextcloud (Framework)",
    "Nextcloud Python API Framework\n\n| **Currently in development, all is under design**\n\n### Provides convenient functions for Python\n\n- Read & write file system objects\n- Working with database\n- Wrapper around `OCC` calls\n- Calling your python function from php part of your app and return a result\n\n### Used by the following apps\n\n- [MediaDC](https://apps.nextcloud.com/apps/mediadc) - Nextcloud Media Duplicate Collector app" : "Framework de API de Python para Nextcloud\n      \n      | **Actualmente en desarrollo, todo está en fase de diseño**\n      \n      ### Proporciona funciones convenientes para Python\n      \n      - Leer y escribir objetos del sistema de archivos\n      - Trabajar con bases de datos\n      - Envoltura alrededor de las llamadas de `OCC`\n      - Llamar a tu función de Python desde la parte de PHP de tu aplicación y devolver un resultado\n      \n      ### Utilizado por las siguientes aplicaciones\n      \n      - [MediaDC](https://apps.nextcloud.com/apps/mediadc) - Aplicación Nextcloud Media Duplicate Collector",
    "Settings successfully updated" : "Configuración actualizada correctamente",
    "Some error occurred while updating settings" : "Ocurrió un error al actualizar la configuración",
    "Use PHP path from settings" : "Usar la ruta de PHP de la configuración",
    "Error" : "Error",
    "Settings list is empty" : "La lista de configuración está vacía",
    "Seems like database not initialized properly. Try to re-enable the app" : "Parece que la base de datos no se inicializó correctamente. Intenta volver a habilitar la aplicación",
    "Bug report" : "Informe de errores",
    "Copied to clipboard" : "Copiado al portapapeles",
    "Collect non sensitive system info for bug report" : "Recopilar información no confidencial del sistema para el informe de errores",
    "Collect system info" : "Recopilar información del sistema",
    "System info" : "Información del sistema",
    "Copy to clipboard" : "Copiar al portapapeles",
    "_Test text_::_Test texts_" : ["Texto de prueba","Textos de prueba","Textos de prueba"]
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}